title: Credential Dumping Activity
id: cred-001
status: experimental
description: Detects potential credential dumping tools
author: Bishwo Prakash Pokharel
logsource:
  product: windows
detection:
  selection:
    CommandLine|contains:
      - lsass
      - sekurlsa
      - mimikatz
  condition: selection
level: critical
tags:
  - attack.credential_access
  - attack.t1003
